//Вывести все четные числа от 0 до N
int n = int.Parse(Console.ReadLine()??"0");
for (int i = 2; i <= n; i += 2) Console.WriteLine(i);